import { Carousel, Typography, Button } from "../components/mtailwind";

export default function Wallpaper() {
  const animeShow = [
    {
      id: 1,
      name: "Oshi No Ko",
      image: "https://images.alphacoders.com/131/1311951.jpg",
      detail: `โกโร่ อามามิยะ หมอสูตินรีเวชผู้เป็นแฟนคลับตัวยงของ ไอ โฮชิโนะ ไอดอลสาวชื่อดัง ได้รับมอบหมายให้ดูแลการคลอดบุตรของเธอ โดยที่สาธารณชนไม่รู้เรื่อง อย่างไรก็ตาม ในคืนที่ไอคลอดบุตร โกโร่ ถูกฆาตกรรมโดยแฟนคลับผู้บ้าคลั่งของไอ และกลับชาติมาเกิดใหม่เป็น อความารีน "อควา" โฮชิโนะ ลูกชายของไอ โดยที่เขายังคงมีความทรงจำในชาติก่อนอยู่ แต่สิ่งที่เขาไม่รู้นั่นคือ รูบี โฮชิโนะ น้องสาวฝาแฝดของอควาคือการกลับชาติมาเกิดของซารินะ เท็นโดจิ หนึ่งในคนไข้ของโกโร่ ซึ่งเป็นแฟนคลับของไอ 4 ปีต่อมา ไอถูกแฟนคลับคนเดิมที่ฆ่าโกโร่ลงมือฆ่าอีกครั้ง`,
    },
    {
      id: 2,
      name: "Tokidoki Bosotto Russia-go de Dereru Tonari no Alya-san",
      image: "https://animetv-jp.net/wp-content/uploads/2024/07/opk-696x392.jpg",
      detail: "อาริสะ มิฮาอิลลอฟนา คุโจ หรืออาเรีย เป็นเด็กสาวมัธยมปลายผมสีเงินที่ดูสวยจนต้องเหลียวมองไม่ว่าจะไปที่ไหน กับคุเซะ มาซาจิกะ ซึ่งนั่งอยู่ข้าง ๆ อาเรีย เป็นนักเรียนที่ไม่มีกำลังใจจะทำอะไร มักจะนอนดึกและเป็นคนง่วงนอนที่โรงเรียน อาเรียมักจะบ่นเกี่ยวกับมาซาจิกะ แต่บางครั้งก็พูดหยอดคำหวานใส่เป็นภาษารัสเซีย อย่างไรก็ตาม เธอไม่รู้ว่ามาซาจิกะนั้นเข้าใจภาษารัสเซีย",
    },
    {
      id: 3,
      name: "One Piece",
      image: "https://wallpapers-clan.com/wp-content/uploads/2024/02/monkey-d-luffy-clouds-one-piece-desktop-wallpaper-preview.jpg",
      detail:  `วันพีซ เป็นเรื่องราวในยุคทองของโจรสลัด โจรสลัดทุกคนมีเป้าหมายเดียวกันคือเพื่อค้นหา สมบัติในตำนานที่เรียกว่า "วันพีซ" โดยผู้ที่เคยครอบครองวันพีซนั้นมีอยู่คนเดียวตามที่เปิดเผยคือ ราชาแห่งโจรสลัด โกลด์ ดี โรเจอร์ ซึ่งหลังจากที่ ได้ครอบครองวันพีซแล้ว โกลด์ ดี โรเจอร์ ได้เป็นราชาโจรสลัด ชายผู้ได้ทั้ง ความมั่งคั่ง ชื่อเสียงและอำนาจ ผู้ที่ได้ทุกอย่างในโลกมาครอบครองนั้น ได้สั่งสลายกลุ่ม จากนั้นแยกย้ายกันไปไม่มีใครรู้อีก 1 ปีต่อมา ก็ได้มอบตัวและยอมรับโทษการประหารชีวิตที่เกาะโพลสตาร์ ที่เมืองโล้คทาวน์บ้านเกิดของตน และก่อนตายได้มีคนถามโรเจอร์เรื่องสมบัติของโรเจอร์ โรเจอร์ได้ทิ้งคำพูดสุดท้ายที่เปลี่ยนยุคสมัยของโจรสลัดว่า "สมบัติของฉันน่ะเหรอ อยากได้ก็เอาไปสิ ไปหาเอาเลย ฉันเอาทุกอย่างบนโลกไปไว้ที่นั่นหมดแล้ว" จากนั้นก็ถูกประหารทันที แล้วเหล่าคนดูในลานประหารก็โห่ร้องกันอย่างดีใจ กับคนที่ทราบข่าวก็ออกเดินเรือไปเป็นโจรสลัดกัน โจรสลัดทั้งหลายจึงมุ่งหน้าสู่ แกรนด์ไลน์ เพื่อตามหาวันพีซ จนโลกได้เข้าสู่ยุคสมัยของโจรสลัด 22 ปีกว่าต่อมา`,
    },
  ];
  return (
    <div className="mx-20">
      <Carousel className="rounded-xl">
        {animeShow.map((item) => (
          <div className="flex mx-20" key={item.id}>
            <img
              src={item.image}
              className="h-1/2 w-1/2 object-cover rounded-xl"
            />
            <div className="inset-0 grid h-full w-full place-items-center bg-black/75">
              <div className="w-3/4 text-center">
                <Typography
                  variant="h1"
                  color="white"
                  className="mb-4 text-3xl md:text-4xl lg:text-5xl"
                >
                  {item.name}
                </Typography>
                <Typography
                  variant="lead"
                  color="white"
                  className="mb-12 opacity-80"
                >
                  {item.detail}
                </Typography>
                <div className="flex justify-center gap-2">
                  <Button size="lg" color="white">
                    Explore
                  </Button>
                </div>
              </div>
            </div>
          </div>
        ))}
      </Carousel>
    </div>
  );
}
